from AmapApi import area
# Api 授权key，请在amap平台注册并获取适用于web服务的key
key = [
    '1******************************8',
    '0******************************f',
    '9******************************0',
    'e******************************8'
]
# 完整poi type列表
#  ['010000','020000','030000','040000','050000','060000','070000','080000','090000','100000','110000','120000','130000','140000','150000','160000','170000','180000','190000','200000','220000','970000','990000']

# 需要遍历执行的typecode列表，下面示例餐饮服务
type_code_list = ['050000']

# 数据库连接，若需使用mysql_natice_password验证请在main.py中修改auth_plugina，表名请在main.py中修改
user = 'root'
password = ''
database = ''

# 启动区域
buffer = [area(x1,y1,x2,y2)] # 详见area类说明

'''
typecode 对应名称
010000	汽车服务
020000	汽车销售
030000	汽车维修
040000	摩托车服务
050000	餐饮服务
060000	购物服务
070000	生活服务
080000	体育休闲服务
090000	医疗保健服务
100000	住宿服务
110000	风景名胜
120000	商务住宅
130000	政府机构及社会团体
140000	科教文化服务
150000	交通设施服务
160000	金融保险服务
170000	公司企业
180000	道路附属设施
190000	地名地址信息
200000	公共设施
220000	事件活动
970000	室内设施
990000	通行设施
'''
